{"text_snippet": {"content": "Aromas include tropical fruit, broom, brimstone and dried herb. The palate isn't overly expressive, offering unripened apple, citrus and dried sage alongside brisk acidity."}}
{"text_snippet": {"content": "This is ripe and fruity, a wine that is smooth while still structured. Firm tannins are filled out with juicy red berry fruits and freshened with acidity. It's  already drinkable, although it will certainly be better from 2016."}}
{"text_snippet": {"content": "Tart and snappy, the flavors of lime flesh and rind dominate. Some green pineapple pokes through, with crisp acidity underscoring the flavors. The wine was all stainless-steel fermented."}}
{"text_snippet": {"content": "Pineapple rind, lemon pith and orange blossom start off the aromas. The palate is a bit more opulent, with notes of honey-drizzled guava and mango giving way to a slightly astringent, semidry finish."}}
{"text_snippet": {"content": "Much like the regular bottling from 2012, this comes across as rather rough and tannic, with rustic, earthy, herbal characteristics. Nonetheless, if you think of it as a pleasantly unfussy country wine, it's a good companion to a hearty winter stew."}}
{"text_snippet": {"content": "Blackberry and raspberry aromas show a typical Navarran whiff of green herbs and, in this case, horseradish. In the mouth, this is fairly full bodied, with tomatoey acidity. Spicy, herbal flavors complement dark plum fruit, while the finish is fresh but grabby."}}
{"text_snippet": {"content": "Here's a bright, informal red that opens with aromas of candied berry, white pepper and savory herb that carry over to the palate. It's balanced with fresh acidity and soft tannins."}}
{"text_snippet": {"content": "This dry and restrained wine offers spice in profusion. Balanced with acidity and a firm texture, it's very much for food."}}
{"text_snippet": {"content": "Savory dried thyme notes accent sunnier flavors of preserved peach in this brisk, off-dry wine. It's fruity and fresh, with an elegant, sprightly footprint."}}
{"text_snippet": {"content": "This has great depth of flavor with its fresh apple and pear fruits and touch of spice. It's off dry while balanced with acidity and a crisp texture. Drink now."}}
{"text_snippet": {"content": "Soft, supple plum envelopes an oaky structure in this Cabernet, supported by 15% Merlot. Coffee and chocolate complete the picture, finishing strong at the end, resulting in a value-priced wine of attractive flavor and immediate accessibility."}}
{"text_snippet": {"content": "This is a dry wine, very spicy, with a tight, taut texture and strongly mineral character layered with citrus as well as pepper. It's a food wine with its almost crisp aftertaste."}}
{"text_snippet": {"content": "Slightly reduced, this wine offers a chalky, tannic backbone to an otherwise juicy explosion of rich black cherry, the whole accented throughout by firm oak and cigar box."}}
{"text_snippet": {"content": "This is dominated by oak and oak-driven aromas that include roasted coffee bean, espresso, coconut and vanilla that carry over to the palate, together with plum and chocolate. Astringent, drying tannins give it a rather abrupt finish."}}
{"text_snippet": {"content": "Building on 150 years and six generations of winemaking tradition, the winery trends toward a leaner style, with the classic California buttercream aroma cut by tart green apple. In this good everyday sipping wine, flavors that range from pear to barely ripe pineapple prove approachable but not distinctive."}}
{"text_snippet": {"content": "Zesty orange peels and apple notes abound in this sprightly, mineral-toned Riesling. Off dry on the palate, yet racy and lean, it's a refreshing, easy quaffer with wide appeal."}}
{"text_snippet": {"content": "Baked plum, molasses, balsamic vinegar and cheesy oak aromas feed into a palate that's braced by a bolt of acidity. A compact set of saucy red-berry and plum flavors features tobacco and peppery accents, while the finish is mildly green in flavor, with respectable weight and balance."}}
{"text_snippet": {"content": "Raw black-cherry aromas are direct and simple but good. This has a juicy feel that thickens over time, with oak character and extract becoming more apparent. A flavor profile driven by dark-berry fruits and smoldering oak finishes meaty but hot."}}
{"text_snippet": {"content": "Desiccated blackberry, leather, charred wood and mint aromas carry the nose on this full-bodied, tannic, heavily oaked Tinto Fino. Flavors of clove and woodspice sit on top of blackberry fruit, then hickory and other forceful oak-based aromas rise up and dominate the finish."}}
{"text_snippet": {"content": "Red fruit aromas pervade on the nose, with cigar box and menthol notes riding in the back. The palate is slightly restrained on entry, but opens up to riper notes of cherry and plum specked with crushed pepper. This blend of Merlot, Cabernet Sauvignon and Cabernet Franc is approachable now and ready to be enjoyed."}}
{"text_snippet": {"content": "Ripe aromas of dark berries mingle with ample notes of black pepper, toasted vanilla and dusty tobacco. The palate is oak-driven in nature, but notes of tart red currant shine through, offering a bit of levity."}}
{"text_snippet": {"content": "A sleek mix of tart berry, stem and herb, along with a hint of oak and chocolate, this is a fair value in a widely available, drink-now Oregon Pinot. The wine oak-aged for six months, whether in neutral or re-staved is not indicated."}}
{"text_snippet": {"content": "Delicate aromas recall white flower and citrus. The palate offers passion fruit, lime and white peach with a hint of mineral alongside bright acidity."}}
{"text_snippet": {"content": "This wine from the Geneseo district offers aromas of sour plums and just enough cigar box to tempt the nose. The flavors are a bit flat at first, then the acidity and tension of sour cherries emerges in the midpalate, bolstered by some black licorice."}}
{"text_snippet": {"content": "Aromas of prune, blackcurrant, toast and oak carry through to the extracted palate, along with flavors of black cherry and roasted coffee beans. Firm but drying tannins provide the framework."}}
{"text_snippet": {"content": "Oak and earth intermingle around robust aromas of wet forest floor in this vineyard-designated Pinot that hails from a high-elevation site. Small in production, it offers intense, full-bodied raspberry and blackberry steeped in smoky spice and smooth texture."}}
{"text_snippet": {"content": "Pretty aromas of yellow flower and stone fruit lead the nose. The bright palate offers yellow apple, apricot, vanilla and delicate notes of lightly toasted oak alongside crisp acidity."}}
{"text_snippet": {"content": "Aromas recall ripe dark berry, toast and a whiff of cake spice. The soft, informal palate offers sour cherry, vanilla and a hint of espresso alongside round tannins. Drink soon."}}
{"text_snippet": {"content": "Aromas suggest mature berry, scorched earth, animal, toast and anise. The palate offers ripe black berry, oak, espresso, cocoa and vanilla alongside dusty tannins."}}
{"text_snippet": {"content": "Clarksburg is becoming a haven for Chenin Blanc in California. This bottling, using fruit sourced from several vineyards in the area, is balanced with just a trace of sweetness in the background (1% residual sugar). This is crisp, straightforward and blessed with notes of pear and lime. Drink it cold."}}
{"text_snippet": {"content": "Red cherry fruit comes laced with light tannins, giving this bright wine an open, juicy character."}}
{"text_snippet": {"content": "Merlot and Nero d'Avola form the base for this easy red wine that would pair with fettuccine and meat sauce or pork roast. The quality of the fruit is clean, bright and sharp."}}
{"text_snippet": {"content": "Part of the extended Calanìca series, this Grillo-Viognier blend shows aromas of honeysuckle and jasmine, backed by touches of cut grass and wild sage. In the mouth, it shows ripe yellow-fruit flavors."}}
{"text_snippet": {"content": "Rustic and dry, this has flavors of berries, currants, licorice and spices. Made from Cabernet Franc and Cabernet Sauvignon."}}
{"text_snippet": {"content": "This shows a tart, green gooseberry flavor that is similar to New Zealand Sauvignon Blanc. Other notes include tropical fruit, orange and honey. Unoaked, with a splash of Muscat, this has commendable dryness and acidity."}}
{"text_snippet": {"content": "As with many of the Erath 2010 vineyard designates, this is strongly herbal. The notes of leaf and herb create somewhat unripe flavor impressions, with a touch of bitterness on the finish. The fruit just passes the ripeness of sweet tomatoes."}}
{"text_snippet": {"content": "White flower, lychee and apple aromas carry the mellow bouquet. The chunky-feeling palate bears powdery, sweet flavors of peach and melon, mixed with greener notes of grass and lime. The 80% Viognier component is typical of the warm climate: plump and oily, with a short finish. Chardonnay fills out the blend."}}
{"text_snippet": {"content": "This concentrated Cabernet offers aromas of cured meat, dried fruit and rosemary. Barbecue spice and teriyaki sauce flavors give the wine a bold, chewy feel."}}
{"text_snippet": {"content": "Inky in color, this wine has plump aromas of ripe fruit, blackberry jam and rum cake. On the palate, it is soft and smooth."}}
{"text_snippet": {"content": "Part of the natural wine movement, this wine is made from organic grapes, and the label is printed with vegetable ink on recycled paper. The quality of fruit is very nice, with a juicy palate and a bright berry flavor on the finish."}}
{"text_snippet": {"content": "Catarratto is one of Sicily's most widely farmed white grape varieties. This expression shows a mineral note, backed by citrus and almond blossom touches."}}
{"text_snippet": {"content": "A stiff, tannic wine, this slowly opens and brings brambly berry flavors into play, along with notes of earthy herbs. There's a touch of bitterness to the tannins."}}
{"text_snippet": {"content": "This is a festive wine, with soft, ripe fruit and acidity, plus a red berry flavor."}}
{"text_snippet": {"content": "The clean, brisk mouthfeel gives this slightly oaked Sauvignon Blanc instant likeability. It's dry with a rich streak of honey that sweetens the citrus, pear and tropical fruit flavors. Pair this with Asian fare, ham or a green salad with grapefruit sections."}}
{"text_snippet": {"content": "A berry aroma comes with cola and herb notes. The palate is tangy and racy, and it delivers raspberry and plum flavors, with a modest finish."}}
{"text_snippet": {"content": "Right out of the starting blocks this is an oaky wine, dripping with caramel and vanilla notes. The texture on the midpalate is finessed and graceful, with drying tannins that latch onto the oak-driven finish. An eccentric blend of 50% Tannat, 35% Petit Verdot and 15% Pinotage."}}
{"text_snippet": {"content": "Spicy, fresh and clean, this would pair with fried seafood or spaghetti con vongole. It offers pretty citrus tones followed by a drying mineral nuance."}}
{"text_snippet": {"content": "This is a sweet wine with flavors of white sugar, orange, honey and vanilla, all brightened by crisp acidity."}}
{"text_snippet": {"content": "This bottling resembles the New Zealand paradigm of Sauvignon Blanc, bearing aromas of grapefruit, passion fruit and kiwi; a sprinkling of graham cracker adds interest. The wine hits the palate like a fleshy fist, with an intense, grassy gooseberry flavor that provides plenty of punch. Pair with apricot-glazed roasted chicken."}}
{"text_snippet": {"content": "Soft and fruity, this is a generous, ripe wine that's full of juicy red-cherry fruits and gentle tannins. It has some richness, giving a sweet character to this open, ready-to-drink wine."}}
{"text_snippet": {"content": "This blend of Nero d'Avola and Syrah opens with savory aromas of cured meat, dried berry, cassis, tobacco and wet earth. There's a touch of almond bitterness on the finish."}}
{"text_snippet": {"content": "This is much different than Casa Silva's 2009 Petit Verdot, which was tasted in the same flight. The '08 is more hard, spicy and tarry, with a leafy, herbal aroma, plus some grittiness. The palate feels snappy, with a can't-miss saltiness. The finish is long in length but short on fruit, with a raw feel."}}
{"text_snippet": {"content": "The Monica grape often shows a rustic or raw quality, with aromas of cherry cola, black pepper and sour fruit. This expression does just that, with an added touch of bright acidity on the finish."}}
{"text_snippet": {"content": "Fruity and lightly herbaceous, this has fine textured acidity along with a pink grapefruit flavor. The wine is bright and easy, and it will be ready to drink in a few months."}}
{"text_snippet": {"content": "A blend of Nero d'Avola and Nerello Mascalese, this delivers forest berry and cola, with blue flower and dusty mineral accents. The palate is easy, bright and lean."}}
{"text_snippet": {"content": "This shows jelly-like flavors of orange and pear, with some earthy tones. The mouthfeel is soft and there's a bounty of oak in the form of buttered toast and caramel notes."}}
{"text_snippet": {"content": "This is weighty, creamy and medium to full in body. It has plenty of lime and pear flavors, plus slight brown sugar and vanilla notes."}}
{"text_snippet": {"content": "There's a touch of toasted almond at the start, but then this Grillo revs up in the glass to deliver notes of citrus, stone fruit, crushed stone and lemon tart. The mouthfeel is crisp and simple."}}
{"text_snippet": {"content": "Lightly herbal strawberry and raspberry aromas are authentic and fresh. On the palate, this is light and juicy, with snappy, lean flavors of red fruit and dry spice. The finish is dry and oaky."}}
{"text_snippet": {"content": "Aromas of cranberry, barrel spice and herb are followed by tart cranberry flavors with grainy tannins. It falls a bit flat and the variety seems hard to discern."}}
{"text_snippet": {"content": "Syrupy and dense, this wine is jammy in plum and vanilla, with indeterminate structure and plenty of oak. Ripe and full-bodied, it has accents of graphite and leather."}}
{"text_snippet": {"content": "This densely hued wine has aromas of black plum and vanilla that carry over to the simple palate along with a touch of cedar. Pliant tannins give it an easygoing nature. Drink soon."}}
{"text_snippet": {"content": "The aromas are brooding, with notes of barrel spice and cherry. The flavors are tart and elegant in style, with lightly gritty tannins backing them up. Best suited to the dinner table."}}
{"text_snippet": {"content": "This fat, yeasty Champagne is comprised predominantly of Pinot Noir. It has ripe red berry fruit, light acidity and a soft, creamy aftertaste. It's ready to drink."}}
{"text_snippet": {"content": "There are intriguing touches to the nose of this bottling, with jasmine, sea salt, wet hay, quinine and rainy sidewalk. The structure on the sip is quite delicate, with golden apple and honey flavors."}}
{"text_snippet": {"content": "From the warm 2015 vintage, this is a soft and fruity wine. It's open with broad white fruit flavors, the acidity lighter than usual for Chablis, giving it a particularly ripe character. Drink now."}}
{"text_snippet": {"content": "This soft, rounded wine is ripe with generous pear and melon flavors. It's easy and ready to drink young for its smooth, attractively ripe character."}}
{"text_snippet": {"content": "A blend of Merlot and Cabernet Franc, this wine brings disjointed lightly volatile aromas of wood spice, vanilla and cherry. The plump cherry flavors are rounded out by woody barrel notes."}}
{"text_snippet": {"content": "Very deep in color and spicy-smoky in flavor, this full-bodied wine is packed with dark-fruit flavors like blackberry and blueberry. Aromas like grilled beef and spicy flavors like cardamom and smoke give it a bold character that's hard to deny."}}
{"text_snippet": {"content": "This cooperative, based in Aÿ, has benefited from the fine Pinot Noir in the village to produce a ripe red fruited wine. With balanced acidity and a soft aftertaste, it is ready to drink."}}
{"text_snippet": {"content": "Aromas of vanilla, char and toast lead to light creamy stone fruit and canned-corn flavors. It provides appeal but the oak seems overweighted."}}
{"text_snippet": {"content": "Big oak defines this robustly dense and extracted red, swimming in vanilla and cherry flavor. Full-bodied and gravelly in texture, it's a rustically pleasant wine for pizza nights and crowds."}}
{"text_snippet": {"content": "Aromas of black-skinned fruit, leather, underbrush, game and a briny note all carry over to the lean, somewhat disjointed palate along with suggestions of licorice and raw red cherry. Grainy tannins leave a drying finish."}}
{"text_snippet": {"content": "Juicy plum, raspberry and pencil lead lead the way in this vineyard designate, a site that's 2,000 feet high. Tobacco and cedar meet a full-bodied hit of oak and puckering tannin, the wine still youthfully wrapped in its full-bodied boldness."}}
{"text_snippet": {"content": "This is the producer's first release of this wine. Fruity aromas of plum and tart cranberry add to its overall sense of lightness and understatement."}}
{"text_snippet": {"content": "This is made from equal parts Cabernet Franc and Merlot, with small additions of Malbec. Juicy, it reveals a raisiny quality of ripeness around integrated oak and generous tannin."}}
{"text_snippet": {"content": "Earthy pollen and mineral notes lend a savory tone to this medium-sweet Riesling. It's soft and slightly pulpy, intensified by overripe tangerine and stone fruit flavors. Drink now through 2018."}}
{"text_snippet": {"content": "This medium-bodied Chardonnay features aromas of pineapple and roasted cashew. Similar notes of ripe pineapple and nuts mark the palate, then ease to a rather soft, easy finish. Drink now."}}
{"text_snippet": {"content": "Some rosés are made simply by bleeding the juice from the fermenter, to concentrate the remaining wine. Whether or not that is the case here, the wine has the simple pleasant lightly candied strawberry flavors one might expect from such a technique. It's fruity and undemanding. Drink up."}}
{"text_snippet": {"content": "Grown on the sandy soil of Tejo, the wine is typically soft and open. It is very accessible—with black fruits and light tannins for this grape. It is ready to drink."}}
{"text_snippet": {"content": "Caramelized oak and vanilla aromas are front and center on a barrel-heavy nose. This feels a bit choppy, with astringent tannins. Herbal salty plum flavors wear a lot of oaky makeup, while this finishes with a forced woody flavor."}}
{"text_snippet": {"content": "Bland, mature aromas of white fruits are on the weak side for Albariño. This feels round and oily, while briny leesy flavors lack pop and precision. A grabby aged finish is short on the free flow that this grape and region are known for. Drink immediately or wait for a newer vintage."}}
{"text_snippet": {"content": "This fruity, sweet wine is immediately attractive and ripe. With its great apricot and pineapple fruit, hints of spicy wood and balancing acidity, it's perfect as an apéritif—light and refreshing. Drink now."}}
{"text_snippet": {"content": "Pale copper in hue, this wine exudes passion fruit on the nose, while the palate delivers nuances of muskmelon as well. It's crisp, racy and medium in body, perfectly suited to summertime refreshment. Drink now."}}
{"text_snippet": {"content": "A healthy addition of 13% Petite Sirah provides added weight and intensity to this wine, a soft, supple and richly conceived combination of smoky black fruit and mocha."}}
{"text_snippet": {"content": "Pronounced dust, pollen and earth tones lend savoriness to this otherwise citrusy wine. Racy acidity and fresh tangerine and lemon flavors turn herbal on the finish. Drink now."}}
{"text_snippet": {"content": "Vibrant aromas of ripe pear, white flowers and melon are followed by a just off-dry palate, with lean fruit flavors."}}
{"text_snippet": {"content": "Softened tannins surround a light-bodied, lean and herbal approach to this vineyard-designate, dotted in black pepper, leather and baked cherry."}}
{"text_snippet": {"content": "Subdued aromas of French oak, toast and acacia waft out of the glass. The rather lean palate offers oak-driven spice, chopped herb and a hint of citrus set against racy acidity. It's rather shy on fruit richness."}}
{"text_snippet": {"content": "Made primarily from Sangiovese, with some Malvasia and other white grapes, this offers aromas of red berry and a yeasty whiff of bread dough. The bright, enjoyable palate offers ripe cherry and hint of pastry cream while a note of honeydew melon marks the close."}}
{"text_snippet": {"content": "This blend of Sangiovese, Malbec, Cabernet Sauvignon, Petite Sirah and other varieties plays well to type. It shows a wealth of ripe, dusty black fruit that's richly round and soft on the palate, approachable and lightly oaked."}}
{"text_snippet": {"content": "This wine has a touch of perceptible sweetness on its tropical nose, yet tastes dry, showing a straightforward approach to this crisp, coastal-grown variety. Apricot, melon and guava wrap around a lightness of body and texture."}}
{"text_snippet": {"content": "All red Bordeaux varieties are represented in this blend, except for Petit Verdot. Together, they offer a simple tannic structure that strengthens a chewiness of leather, tobacco and a touch of cedar. Full bodied, it's a ripe, bold and brawny wine."}}
{"text_snippet": {"content": "Freshness characterizes the nose: green pear, ivy leaves and citrus notes play on nose and palate. This is light footed, easy drinking and charming. Drink soon while flavors are fresh."}}
{"text_snippet": {"content": "Barrel notes are prominent, with aromas of Creamsicle and baking spice. The palate is broad and dry with stone-fruit and barrel flavors. It provides intrigue but the wood seems to get in the way at times."}}
{"text_snippet": {"content": "This is a dense wine, packed with both tannins and acidity. It brings out the ageworthiness of this appellation with its rich potential and dark mineral texture. Drink this concentrated cru wine from 2018."}}
{"text_snippet": {"content": "The wine comes from one of the cru estates followed by this negociant house. It is a light, ripe and fruity wine. With its attractive red-berry flavors, finished with crisp acidity, it is accessible and ready to drink."}}
{"text_snippet": {"content": "A wisp of bramble extends a savory tone from nose to finish on this otherwise bright bristling wine. Delicate honey tones register as off dry on the palate but balance neatly alongside flavors of freshly pressed apples and pears. The finish is marked by a touch of pencil lead. Drink now through 2020."}}
{"text_snippet": {"content": "Forest floor, menthol, espresso, cranberry and pressed violet aromas take shape in the glass. The lean linear palate shows dried sour cherry, licorice and coffee bean alongside assertive close-grained tannins. Even though the tannins are still firm, drink sooner rather than later to capture the remaining fruit."}}
{"text_snippet": {"content": "This blends 20% each of all five red-Bordeaux varieties, showing grapy, plummy flavor that's juicy and soft on the palate. With a core of tobacco, tar and graphite, it complements the fruity with the savory, ending simply and elegantly."}}
{"text_snippet": {"content": "Fresh apple, lemon and pear flavors are accented by a hint of smoked nuts in this bold, full-bodied Pinot Gris. Rich and a bit creamy in mouthfeel yet balanced briskly, it's a satisfying white with wide pairing appeal. Drink now through 2019."}}
{"text_snippet": {"content": "Dusty mineral, smoke and struck flint lend a savory tone to this lean light-bodied Riesling. Off dry in style, the palate offers delicately concentrated flavors of red apple and nectarine off set by tangerine acidity. Drink now through 2021."}}
{"text_snippet": {"content": "Intensely smoky tones of struck flint and ash extend throughout this otherwise bright nimble Riesling. The palate boasts freshly pressed apple and pear flavors accentuated by zippy lemon-lime acidity. Drink now through 2021."}}
{"text_snippet": {"content": "A bright nose with green apple and citric aromas comes with mild oak. This is acidic and racy in composition, with roundness along the edges of the palate. Apple and nectarine flavors are lightly oaked and salty, while this holds form on a high-acid finish."}}
{"text_snippet": {"content": "Made with 65% Sangiovese, 20% Merlot and 15% Cabernet Sauvignon, this has subtle aromas of black-skinned fruit and thyme. The easygoing palate delivers black cherry and cinnamon alongside smooth tannins."}}
{"text_snippet": {"content": "Made predominantly with Trebbiano and Malvasia, along with Pinot Bianco, Pinot Grigio and Riesling Renano, this has inviting aromas of ripe orchard fruit and citrus. The round fruity palate doles out ripe apricot, orange zest and juicy pineapple."}}
{"text_snippet": {"content": "A blend of Cabernet Sauvignon, Merlot, Cabernet Franc and Sangiovese, this pleasant red has aromas of dark-skinned fruit, toast and a whiff of espresso. The light-bodied, straightforward palate offers cherry, red currant and a hint of light spice alongside zesty acidity and polished tannins."}}
{"text_snippet": {"content": "Aromas of yellow stone fruit, white spring flower and a whiff of citrus lift out of the glass. The soft round palate offers ripe apricot, yellow peach and a hint of candied nectarine zest."}}
{"text_snippet": {"content": "Lots of spearmint, coyote mint, hot licorice, ginger snaps and Dr Pepper spice up the strawberry fruit of this wine that provides a very herbal take on the grape. Oregano, marjoram, thyme and dill all make a showing on the sip, against a backbone of sweet cherry and blackberry fruit, finishing on cedar."}}
{"text_snippet": {"content": "An easy-drinking blend of Merlot, Sangiovese and Cabernet Sauvignon, this opens with aromas of red berry, toast, herb and roasted coffee bean. The soft palate offers black cherry, mocha and a hint of coffee alongside bright acidity and silky tannins. Drink now."}}
{"text_snippet": {"content": "Produced from cru vines at the base of Mount Brouilly, the wine has structure as well as ripe black-plum fruits. It is generous and its fruit is well balanced by acidity and solid tannins. The wines is ready to drink."}}
{"text_snippet": {"content": "This 100% varietal wine opens in a heady aroma of leather pouch, clove and marshmallow. Both herbaceous and tannic, it begs for more time in the bottle or substantial swirling in the glass."}}
{"text_snippet": {"content": "Made with 90% Merlot and 10% Alicante, this easygoing red opens with delicate aromas suggesting red currant and baking spice. The straightforward palate delivers red plum and clove alongside soft tannins. Enjoy soon."}}
{"text_snippet": {"content": "Made with Vermentino, Malvasia di Candia Aromatica and Petit Manseng, this easy-drinking white has aromas of fragrant white wild flower, citrus and white stone fruit. The ripe round palate offers apricot, lime and a hint of saline."}}
{"text_snippet": {"content": "Tar, dried meat, olallieberry and sharp cedar aromas show on this blend of 51% Cabernet Sauvignon and 49% Merlot. Dried strawberries and plums mix with thyme and dried rose petals on the palate."}}
{"text_snippet": {"content": "Poached pears, yellow apples and a touch of butter show on the classic nose of this Chardonnay that holds to steely frame. Very sharp acidity kicks off the sip, where Pink Lady apples and warm vanilla surround a tight minerality. It's both sharp and slightly sweet."}}
{"text_snippet": {"content": "The distinctive nose on this bottling is tight yet tropical, with mango, pineapple, pear skins, orange rinds, dried lime peels and a gin-like juniper all converging. The palate offers a balance between tightly woven texture and ripe tropicality, with lime rinds, mango and petrol touches."}}
{"text_snippet": {"content": "Baked red cherry, crushed clove, iron and rose petals make for standard aromas on this bottling, although they are fairly light and simple here. There is a sizzle of acitity on the palate, where juicy strawberry and olallieberry flavors are easy to enjoy, made more complex by graphite and cedar touches."}}
{"text_snippet": {"content": "A blend of 50% Cabernet Sauvignon, 30% Merlot and 20% Sangiovese, this offers aromas of black currant, caramel and mocha. The dense palate delivers toast, leather and cedar alongside teeth-coating tannins that grip the finish."}}
{"text_snippet": {"content": "Medium-gold in color. Complex and inviting nose layered with a strong earthy minerality, vibrant bright fruit and intriguing notes of petrol and honey. On the palate it is racy, taut and focused full of well defined ripe succulent citrus and stone fruit. Rich, viscous texture perfectly balanced by the wine's crispness and almost steely minerality. Very long, juicy, lingering finish."}}
{"text_snippet": {"content": "Slightly backward, particularly given the vintage, the wine has a complex nose with plenty of dark fruit, Turkish delight, smoked meat and earth. A full rich palate, slightly soft, it begins to run out of steam a little in mid palate, but returns with a flourish, and the finish is long and nuanced. Will repay 5+ years of cellaring."}}
{"text_snippet": {"content": "The vineyard is one of the better Chardonnay sources in Alexander Valley, and in this fine vintage it lends ripe pineapple, pear, Key lime pie and Mandarin orange flavors to the wine. Lots of toasty new oak adds buttered toast and vanilla, but the wood influence is in balance. Classic Burgundian-style California Chardonnay, rich and opulent."}}
{"text_snippet": {"content": "Defines Rockpile Zinfandel in intensity of fruit and high alcohol which is in keeping with the volume. There are few red wines in the world like this. It's fully dry, with potent flavors of baked blackberries, blackcurrants, cola and peppery spices, and the tannins are huge, but negotiable. Demands the richest grilled meats and cheeses."}}
{"text_snippet": {"content": "The blend is roughly two-thirds Shiraz and one-third Cabernet, and the result combines berries with cassis and generosity with structure, all framed by toasty oak. Savory in character, long and dusty on the finish. Drink now-2018."}}
{"text_snippet": {"content": "This sophisticated wine is mostly Cabernet Sauvignon, which accounts for the firm tannins and dense structure as well as most of the blackberries and blackcurrants. Smaller amounts of Merlot and Cabernet Franc add cherries and violets, while oak contributes smoky complexities. Rich and elegant, the wine provides lovely drinking now."}}
{"text_snippet": {"content": "Etienne Le Riche is a total Cabernet specialist. With a tiny production of 5,000 cases across all his wines, this is boutique in the best sense. The Reserve Cabernets are, of course, the stars. This 2003 is fruit and wood driven, a powerful but still elegant wine, with black plums, tannins and super-ripe fruits."}}
{"text_snippet": {"content": "Mid-gold color. Pronounced and enticing aromas of ripe citrus and stone fruit, layered with honey and floral notes with a touch of sweet spice. Rich and creamy texture packed with sweet ripe juicy fruit, honey, spice and a twist of sage. Off-dry, deliciously smooth with fresh acidity and medium-body. An elegant wine with a long, creamy, spicy finish."}}
{"text_snippet": {"content": "Attractive mid-gold color with intense aromas of ripe citrus and stone fruit, strong minerality and hints of spice. Racy with crisp acidity, juicy, rich and smooth texture with lots of concentrated, bright flavors of blood orange, peach, apricot, mango and spice. Strong minerality follows through to a long, precise, juicy finish."}}
{"text_snippet": {"content": "Compelling minerality on the nose, Refined and focused floral aromas with ample ripe stone fruit and a hint of petrol. Racy acidity and lovely taut palate with generous layers of juicy ripe peach, apricot and nectarine.  Strong minerality prevails across the palate leading to a lingering finish. Very balanced."}}
{"text_snippet": {"content": "A big, black bruiser of a wine that has black olive flavors and aromas and plenty beyond. Raspberry, mulberry, vanilla and spice all vie on the nose, while the palate is so dark it´s tough to discern the plum and leather flavors. Give it three years and reap the benefits."}}
{"text_snippet": {"content": "At the first it was quite muted and subdued, but over a ten minute period it developed beautifully in the glass. The dark fruit is still dominant, but it is beginning to show some interesting tertiary aromas of earth, mushrooms and leather. Well balanced with a medium finish. Needs a few more years, but can be enjoyed now with a good deal of pleasure."}}
{"text_snippet": {"content": "Attractive mid-gold color. Compelling layers of tangy citrus and stone fruit aromas with notes of honey and earthy minerality. Intense flavors of honey, tangy orange citrus, sweet peach and apricot that are both rich and juicy.  Crisp acidity provides a perfect balance for the slight sweetness on the finish. Taut and focused."}}
{"text_snippet": {"content": "A Cabernet-dominated (98%) wine, which boasts a dense, concentrated tannic structure. Flavors of cassis underly this, while the wood spices contribute their ribbon of flavor. This is an impressive wine, the flagship red from this estate founded by Spatz Sperling over 30 years ago."}}
{"text_snippet": {"content": "Einaudi's wines have been improving lately, and this Barolo was very impressive, given the trying conditions of the vintage. Big rich, fat with smoked meat and a good dose of oak, the wine was one of the few that didn't peter out early but stayed on the palate to the end, culminating in an nice easy finish."}}
{"text_snippet": {"content": "Give this young Cab time in the cellar to come around. Right now, it's fresh and tannic, with primary fruit blackberry and cherry flavors, and the sweet smoky oak hasn't been integrated. Should knit together over the next 4-6 years, at least."}}
{"text_snippet": {"content": "The color is just beginning to show signs of browning at the edge, but the wine is still fresh and vibrant. The nose is complex, showing licorice, summer fruits, caramel and roses. On the palate, it is soft and pleasant, but lacks some concentration.  At its peak, but will drink well for a few years."}}
{"text_snippet": {"content": "This wine's black cherry and plum flavors veer dangerously toward prune—no doubt a product of the exceedingly hot summer. It's creamy and supple in texture, adding just enough tobacco, vanilla and smoke for complexity. But for all the fruit and ripeness, it finishes with great elegance and precision. Drink now–2020. Imported by Acadia Imports."}}
{"text_snippet": {"content": "This is great Chenin Blanc, wood fermented but still leaving all the varietal character. Rich, creamy, almond flavors and silky smooth, which keeps all the essential acidity of the grape, with added spice and vanilla."}}
{"text_snippet": {"content": "Mid-gold color. Very mineral driven with subtle aromas of bruised apple and stone fruit compote. Crisp, fairly taut palate showing strong minerality and ripe flavors of red apple, cantaloupe, sweet nectarine and spice. Taut and precise texture with a long, slightly austere finish."}}
{"text_snippet": {"content": "Beautiful deep gold color. Intense, concentrated nose with vibrant aromas of honey, citrus marmalade and savory botrytis notes. Deliciously sweet and succulent, yet balanced by good acidity.  Packed with flavors of sweet ultra-ripe stone and tropical fruit, with honey and botrytis notes following through. Strong minerality prevails to a long, complex finish."}}
{"text_snippet": {"content": "A big, fat, luscious wine with plenty of toasty oak, dark jammy fruit and spices. The palate showed the same lushness; with the fruit front and center with surprising length.  A delicious, rather hefty effort short on finesse but long on flavor."}}
{"text_snippet": {"content": "This is one of the more complex wines from the 2003 vintage. The nose has aromas of blackberry liquer, smoked meat, truffle and road tar. On the palate the fruit seems a little heavier and more roasted, but still melds well with its earthy, mushroomy flavors. Medium finish."}}
{"text_snippet": {"content": "A beautiful wine, sleek, crisp and ultra-dry, with the most refined flavors of petrol, white peach, kaffir lime, apricot skin and minerals. The acidity is very high and palate-cleansing. The wine was half fermented in barrels, half in stainless steel. Sommeliers, buy this by the case, if you can find it."}}
{"text_snippet": {"content": "Rich gold in color. Broad, layered aromas of very ripe fruit with hints of sweet smoke, brown sugar, honey and a savory earthy minerality. Full-bodied, bone dry, but richly textured with crisp acidity and a wide palette of flavors, ripe stone fruit, a creamy savory earthiness, sage and a balsamic kick on the finish. Very long length, slightly warm but with a lingering savory, mineral finish."}}
{"text_snippet": {"content": "Thick and brooding, this dark, sweetly tannic wine also offers higher-toned elements of cedar, dried herb and graphite. It finds its balance amid a full-bodied density of fruit concentration and girth of structure. Drink now through 2023."}}
{"text_snippet": {"content": "Cooked cranberry is spiced with anise, peppercorn and roasted beef slices on this bottling from a vineyard planted by three brothers who are longtime Salinas Valley farmers. The palate shows dark cranberry and raspberry, spiced up by chopped sage, thyme and bay leaf."}}
{"text_snippet": {"content": "There's a touch of hot asphalt, pencil lead and miso on the nose of this first vintage from a promising, well-funded project, with dark elderberry fruit and dried dill rounding out the aromas. The palate blends a gamy beef quality with oregano, marjoram, cooked strawberry, baked blackberry and a sesame-oil character."}}
{"text_snippet": {"content": "Black cherry, black plum and black currant are integrated well into the fresh dill and smoke scents on the nose of this wine from one of the region's newest properties. It discloses a rich dark-chocolate sauce character on the palate as well as black-currant-jelly flavors, but most impressive is the lush, sexy and soft mouthfeel."}}
{"text_snippet": {"content": "Crisp, pristine peach and apricot notes resonate through the nose and palate of this fresh, blossomy dry Riesling. While zesty and lithe in body, ripe grapefruit and melon flavors feel supple and silky on the palate. Drink now through 2019."}}
{"text_snippet": {"content": "Smashed blackberry and blueberry fruit are enhanced by burned caramel, heavy slate and touches of soy and smoke on the nose. There's great depth in both body and flavors once sipped, with a layer of fine-grained tannins revealing teriyaki, black plum, boysenberry and touches of lavender."}}
{"text_snippet": {"content": "This wine shows off Yountville fruit at its finest, starting with a floral component to the nose. Spicy, bright and lifted, it coats the palate in ripe berry and cherry, ending with a snap of vanilla."}}
{"text_snippet": {"content": "This bottling shows a rich, wood-aged wine, full of ripe yellow and tropical fruits as well as rich toasty flavors. The wine is warm, rounded, spicy and with its impressive structure still developing, it has the potential to age well. The wine is named to celebrate the second Lança generation in charge at the estate. Drink from 2017."}}
{"text_snippet": {"content": "From a promising new project, the nose of this wine is linear and focused, with black raspberry, black licorice, cola, wet sagebrush and rain-on-slate scents. The tactile acidity once sipped creates a fascinating soft buzz on the tongue, with flavors of dried mint, brisk raspberry and cherry tomato. Camphor and eucalyptus add intrigue on the finish."}}
{"text_snippet": {"content": "Dark and thick in the glass, this wine shows strong but not bitter tar notes on the nose plus charred beef in a blueberry glaze, wet campfire, bourbon barrel and vanilla. The structure is massive now, gooey with thick tannins and flavors of espresso bean and condensed purple flowers. Judicious acidity ensures strong cellaring potential. Drink 2018–2027."}}
{"text_snippet": {"content": "Ripe aromas of raisin, black plum and horsehide are pointy and peppery. On the palate, this Graciano is bold and energetic, with lifting acidity. Loud berry flavors come with strong accents of dark chocolate and bitter espresso, while the finish is long but just moderate in complexity. Drink through 2020."}}
{"text_snippet": {"content": "Bradley Brown's appellation blend is a nice entry point to this exciting winery. This wine shows lavish smoked black currant and plum flavors, with aromatically lifting spices of anise and black pepper and a savory roast-beef element. The palate packs lots of pepper and relies on plump black cherry, boysenberry and a dark-chocolate syrup richness."}}
{"text_snippet": {"content": "Approachably fruity yet nuanced and electrifying, there's exceptional value here. High-intensity flavors of tangerine and stone fruit sweeten the palate, balanced by nerve-tingling acidity and deep ripples of slate, salt and honeycomb. It's an intensely zesty wine, but the finish has length and power."}}
{"text_snippet": {"content": "From an estate in the south of the Alentejo, this is a rich, hot-country wine. It is firm, densely structured and with solid, dark tannins. There is a juicy black fruit background to this dense wine that gives a lift. Still young, this dark and very concentrated wine will be better from 2018."}}
{"text_snippet": {"content": "Baked plum, Asian spice, vanilla and menthol aromas carry the nose. The elegantly structured palate offers fleshy black cherry, licorice, mint and well-integrated French oak alongside fine-grained tannins that lend firm, polished support. A coffee note marks the finish."}}
{"text_snippet": {"content": "Intense aromas of ripe red berry, menthol, espresso and star anise lead the nose. The concentrated palate offers cranberry, dried Morello cherry, sage and licorice alongside close-grained tannins that grip the finish. Drink from 2018 through 2025."}}
{"text_snippet": {"content": "Low-yield vines on the best parcels of the Vincens estate are the source of this wine. It is super-rich and concentrated, maybe too much in its opulent excess. The wine does have great plum and berry flavors that are generous and full in the mouth. The wine even now is still young and will be better from 2018."}}
{"text_snippet": {"content": "A hearty blend of 76% Zinfandel and 24% Petite Sirah, this bottling packs a wallop of cinnamon-stick on the nose as well as strawberry puree, licorice and black pepper. Clove, allspice, and nutmeg arise immediately on the sip, backed by baked plum and bay leaf notes."}}
{"text_snippet": {"content": "More complex than the winery's appellation blend, yet also requiring time to reach full potential, this shows delicate lemon slices, honeysuckle, surf wax, pink grapefruit and a touch of coconut on the nose. The palate is grippy in texture and sizzling with mouthwatering acidity, offering lemon rind, grapefruit spritz and petrol flavors. Expect inviting nut and honey-dust flavors to emerge. Drink 2018–2034."}}
{"text_snippet": {"content": "Produced from vineyards donated to a charitable hospital in the 19th century, this wine is rich and now perfectly mature. It has smoky tannins that lie under the fine, elegant cherry and red plum fruits and acidity. The wine still has freshness although the attraction here is the ripe structure. The ornate label dates back to 1926."}}
{"text_snippet": {"content": "This blend of Cabernet Sauvignon, Syrah and Merlot opens with blackened aromas of charred oak and creosote, but it quickly sheds that oak-heavy character to display toasty flavors of olives, herbs and berry fruits. All together, this is a classic Chilean red blend, with fine tannins and patented lightly herbal, balsamic flavors. Drink through 2020."}}
{"text_snippet": {"content": "Dry, briary aromas of field brush, black olive, herbs, berry fruits and saucy tomato are textbook Maipo. This is fresh, a touch choppy, and not overly heavy. Flavors of cassis, plum and vanilla carry over to the finish, which is fresh and bolstered by fine natural acidity. Drink through 2022."}}
{"text_snippet": {"content": "Of course, this 90% Tannat wine is still very young. But it's impressive, rich and concentrated and promises to age well. It is dense with both tannins and fruit, black plum and berry flavors dominating, cut by acidity. It will be ready to drink from 2019."}}
{"text_snippet": {"content": "The addition of 15% Petite Sirah takes this bottling to a compelling place, showing barely ripe blackberries, animal fat, smoke, black pepper and a wild clove element on the nose. It's rich and layered on the palate, where chalky tannins support black cherry, grilled beef and mint flavors. This has the bones to last awhile."}}
{"text_snippet": {"content": "A fairly elegant expression of the variety, this wine is bright in cherry kirsch and pretty aromas of rose petal and lavender, structured to age and enjoy with food. Rector Creek Vineyard is just north of Yountville and planted in rocky alluvial soils. Drink now through 2022."}}
{"text_snippet": {"content": "This wine is put together from multiple vineyard sources, including the well-known Morelli Lane and Widdoes, all farmed by the Duttons. Larger in production than many of the vineyard-designates, it offers baked bread and juicy overtones of cranberry-raspberry layered atop luxuriously toasted oak. It'll show well at the table."}}
{"text_snippet": {"content": "Fresh and fragrant of blossoms, tart yellow peach and apricot, this off-dry Riesling maintains a crystalline fruit purity that persists throughout Fritz Haag's wines. It's invigorating and irresistably quaffable. The long, melon-rind finish is lip smacking."}}
{"text_snippet": {"content": "Just a touch of honey-lemon sweetness is enough to make this zesty, citrus-focused Riesling lip smackingly delicious. Fresh, green herb and lime notes reverberate through a strong finish. Drinks well now but should meld nicely over the next five years."}}
{"text_snippet": {"content": "Dry, spicy aromas of tobacco, cedar, vanilla and berry fruits come together nicely. This Maule Valley Cab is fresh and harmonious across the palate, with nothing too pushy. Complex, balsamic flavors of olives, herbs, dried berries, turned earth and cocoa finish dry, peppery and elegant. Drink through 2019."}}
{"text_snippet": {"content": "This wine is bursting with gorgeous cherry fruit, forward and luscious. The tannins are ripe and the acids in perfect proportion, keeping the fruit flavors buoyed upon a textural ride into a lingering finish."}}
{"text_snippet": {"content": "The Stoneleigh style traditionally favors ripeness over herbaceousness, and the 2008 holds true to form, offering up grapefruit and nectarine aromas and an appealing blend of citrus and stone-fruit flavors. It's plump and round, yet finishes fresh. Good as an apéritif or with light dishes."}}
{"text_snippet": {"content": "Crisp and fresh with enduring aromas of tomato leaf, citrus, pink grapefruit and white stone, this is textbook Sauvignon from the mountainous Alto Adige region of Italy. Pair it with appetizers or lightly spicy foods."}}
{"text_snippet": {"content": "Haven't seen this unusual combination of grapes in quite some time, and you know what, it's much better now than when we last saw it in 2001. This vintage has a nice, almost magnetic nose, while the palate is firm and well structured, with cassis, black cherry, coffee and licorice flavors. It's a bit boring on the finish, but the mouthfeel and length are just fine. Fruity, rich and balanced. 325 cases made."}}
{"text_snippet": {"content": "This Chianti Classico strikes a beautiful balance between elegance and intensity. It has both and its pretty aromas of wild berry, rose, ginger, anise and spice come forth in a continuous, steady manner. It feels bright and lively in the mouth and ends with a touch of piquant spice."}}
{"text_snippet": {"content": "Black as a moonless night, dense in structure, tannic, bone dry and super-peppery, this Syrah isn't offering much relief right now. In all likelihood it will emerge from its cocoon in a few years to offer a wealth of ripe blackberry, currant and carob fruit."}}
{"text_snippet": {"content": "The impact of 50-year old vines is seen in the concentrated fruit, ripe and full,  in this wine. The flavors are of fresh apricots, edged with green apples and pink grapefruit, a combination that shows both richness and great freshness. The finish is a reminder of the fine acidity in 2006."}}
{"text_snippet": {"content": "This is a strong, oaky Chardonnay. It's crisp in acidity and forward in pineapple jam, lemon custard and vanilla meringue flavors. If you like the ripe, California style, it's for you."}}
{"text_snippet": {"content": "Crisp, coastal acidity dominates this wine, making it mouth-wateringly tart. May be too much for some folks, but it's quite elegant, with good cherry, black raspberry and cola flavors enriched with a touch of smoky oak."}}
{"text_snippet": {"content": "Loaded with bold, ripe fruit, exotic spice and leather, this is a simple but genuine expression of Brunello di Montalcino. The wine tastes thick and a bit chunky in the mouth because of its chewy, succulent tannins."}}
{"text_snippet": {"content": "With attractive melon and other tropical aromas, this is a Torrontés that rises above the masses. It smells great and tastes like a pure blend of lychee fruit, tangerine and honeydew melon. The palate feel is smooth and round, and the finish is dry, clean and healthy. It's everything that Torrontés should be. Drink now."}}
{"text_snippet": {"content": "This is a typical Sonoma Coast Chard in the bright acidity that firms up the ripe, long hangtime flavors. Pineapples, pears, peaches, nectarines and subtle papaya notes are joined with buttercream and cinnamon spices. Drink now."}}
{"text_snippet": {"content": "Composed and structured, with its fair share of richness manifested as raisin and molasses. Interestingly, the palate rings with acidity, resulting in a feel that's borderline sharp. But there's enough fruit and heft to balance things out, and the flavors of cherry, blackberry and cola are nice. A good example of elevated Carmenère (with 10% Cabernet Sauvignon) that doesn't cost an arm and a leg."}}
{"text_snippet": {"content": "This is a very rich Pinot whose primary virtue is fruit. It just explodes with delicious cherry jam, red currant, licorice and mocha flavors. Dry and crisply acidic, it's a beautiful wine for early drinking."}}
{"text_snippet": {"content": "This is a luminous, mature red wine with thick concentration and huge—almost too much—emphasis on toasted oak. Aromas recall vanilla, spice and coffee, although you will find blueberry and cherry on the finish: It is a blend of Nero d'Avola, Cabernet Sauvignon and Merlot."}}
{"text_snippet": {"content": "Bisquertt usually does well with its value-priced Merlots, and seeing that 2007 was an excellent vintage in Chile, this wine excels in the value price range. The nose is dark and saturated, but pure and inviting. And the palate is ripe and smooth, with spice, plum, blackberry and herb notes, particularly anise. Finishes clean, smooth and peppery. Drink now."}}
{"text_snippet": {"content": "Clean and honest up front, with moderate richness and modest telltale Casablanca pineapple aromas. The plate is creamier than many wines in this price range, with flavors of apple cider, citrus and some pith. Overall this is a good value wine with enough citrus and acidity to qualify it as fresh."}}
{"text_snippet": {"content": "Chocolate, espresso, plum and black currant are backed by smoky nuances and natural rubber. This muscular wine offers polished tannins and firm structure to the end. A bit of wine from the 2005 and 2006 vintages is blended in."}}
{"text_snippet": {"content": "From the little-known region of Padthaway, this Cabernet starts off with some very promising, perfumed aromas of mint and cassis, but then shows touches of chocolate and raisined fruit on the palate. It's soft and mouthfilling—an easy-drinking Cab to consume on the young side."}}
{"text_snippet": {"content": "Here's an interesting blend of Corvina, Cabernet Sauvignon and Rondinella that reflects the aromas and power of each grape variety. The wine offers mature notes of cherry, clove, blackberry and cola: It tastes slightly sweet and very succulent."}}
{"text_snippet": {"content": "A citrus-dominated wine, lime and lemon giving a crisp intensity. There is a somewhat bitter toast element, but the acidity, the fresh fruits and the soft structure act as a counter-balance. Give it six months to a year. Screwcap."}}
{"text_snippet": {"content": "Here's a traditional Chianti Classico with pretty aromas of cherry cola, mesquite, almonds and violets. The wine is compact and elegant in the mouth and offers crisp berry flavors on the close."}}
{"text_snippet": {"content": "This is a mature, jammy wine with thick layers of plum, prune and raisin. The wine's appearance is dark and concentrated and that same sensation of heaviness carries over the palate in the form of black currant and spice. The tannins are firm and tart."}}
{"text_snippet": {"content": "Pancole is a pretty expression of Tuscany's popular Vernaccia di San Gimignano with a luminous, bright appearance and pristine aromas of stone and passion fruits. The wine is lean and tonic with spicy notes on the finish."}}
{"text_snippet": {"content": "This is a concentrated, fairly full and lush Chenin, rich in toasty oak and vanilla cream as well as notes of baked apple pie and sweet orange. The medium-weight palate is mouthfilling and satisfying, with ample acidity to lift the decadent flavors. Notes of clove, anise and toasted nuts mingle on the lingering finish. Drink now–2019."}}
{"text_snippet": {"content": "This is a soft, well-crafted wine from the eastern side of St. Helena that's both classic in its dried herb, tobacco and tea aromas and fruity with red currant and cranberry notes."}}
{"text_snippet": {"content": "This is a beatifully balanced, not-too-full-bodied wine from vines grown at 2,400 feet in the Sierra range. It has classic black cherry, black olive and anise aromas, harmonious fruit flavors accented with light oak spiciness and a firm, fine-grained tannic structure."}}
{"text_snippet": {"content": "Aromas of mature black-skinned berry, tobacco and dark spice lead the way. The rounded palate offers dried cherry, raspberry, coffee and a licorice note alongside velvety if not very persistent tannins. Showing the heat of the vintage, this is evolving quickly so enjoy over the next several years."}}
{"text_snippet": {"content": "Made with 60% Pinot Bianco, 30% Chardonnay and 10% Sauvignon Blanc, this boasts appealing aromas of acacia flower, nectarine and Alpine herb. The elegant palate delivers juicy Gala apple, yellow peach and a touch of ginger alongside fresh acidity."}}
{"text_snippet": {"content": "This wine features pleasing aromas of raspberry, jumper berry and black pepper. There is a nice mélange of fruit and spice flavors, notably black cherry, dark plums, anise, and cardamom. Smooth tannins ply the palate right into a bright finish that bears a touch of salinity."}}
{"text_snippet": {"content": "A year in wood and 30 months in bottle before release have allowed this attractive wine to fully develop its solid yet smooth texture. It has concentration, layers of bright black currant fruit and vibrant acidity. Ready to drink."}}
{"text_snippet": {"content": "This bottling belongs to a series of wines from the legendary Jerry Lohr emphasizing Rhône varieties. It shows candied blackberry, violets and potpourri on the fruity, flowery and inviting nose. The palate leads with savory black pepper, which accents its core of black plum, blackberry and purple flower flavors."}}
{"text_snippet": {"content": "Rich honeysuckle, marzipan and oak aromas meet bright lemongrass on the nose of this bottling, showing both the fresh and oxidative sides of the grape. Smoked chicken and brioche notes are prominent on the palate, leading to a tangy, botanical, juniper-laced finish."}}
{"text_snippet": {"content": "This is an extraordiary deal for a solidly built, high-level wine. It offers succulent cherry, raspberry and vanilla flavors, wrapped in approachable, mellowed tannin and oak."}}
{"text_snippet": {"content": "Juicy and austere in understated waves of cranberry and cherry fruit, this wine delivers subtle power and intensity in a leathery-textured package. True to its old vine heritage, it shows a dry dustiness of peppery spice."}}
{"text_snippet": {"content": "A stony, flinty character leads the nose of this blend of 54% Sauvignon Blanc and 46% Sémillon, followed by scents of ripe peach, nectarine, freshly dried grass and herbs. The medium-weight palate offers more clean fruit flavors that result in a smooth, slightly creamy mouthfeel. Ample acidity lends freshness to the finish, alongside a lingering yellow flower character. Drink now–2019."}}
{"text_snippet": {"content": "Intriguing, thought provoking and complex, this wine starts off with perfumed aromas of thyme, bay leaf and lavender. It's supple in the mouth and silky in feel, imbued with black cherry and blueberry fruit, then shows a hint of adhesive bandage on the finish. Drink now."}}
{"text_snippet": {"content": "This leads with clean yet soft scents of ripe apple, Anjoy pear and orange blossom. Those notes carry through to the medium-weight palate, well integrated with soft toasted-oak tones. It's harmonious and balanced, with ample acidity lending good lift through the close. Drink now."}}
{"text_snippet": {"content": "This is taut and sinewy in profile, but shows off a fine range of aromas, from thyme and lavender to cocoa, red plum and ripe cherry. The raspberry and herb flavors finish in a storm of firm tannins. Drink 2020–2025."}}
{"text_snippet": {"content": "Mellow white-fruit aromas are nonspecific and oaky, but not overly so. This barrel-fermented Verdejo feels plump and chunky, with balancing acidity. Salty melon, apricot and apple flavors end steady and long. For barrel-fermented Verdejo, this is at the top of the pile."}}
{"text_snippet": {"content": "This blend of 60% Petite Sirah, 21% Syrah, 7% Grenache, 6% Petit Verdot, 5% Tannat and 1% Viognier is tightly wound but likely to improve with time. Opened now, it offers elderberry, black currant, pencil lead and loam on the nose, with lava rock, crème de cassis and kirsch flavors slowing emerging on the palate."}}
{"text_snippet": {"content": "This is a big, brawny expression of Grenache, Mourvèdre, Syrah and Counoise, the Grenache playing the dominant role in the blend. It coats the palate in dense raspberry and blueberry fruit, seasoned with pepper and nutmeg. A leathery touch to the texture and lifted acidity keeps it from feeling heavy or overdone."}}
{"text_snippet": {"content": "Aromas of blackberry, fennel bulb and smoke set the scene for flavors of cherry, raspberry, chocolate and tobacco leaf. Mellow but ever-apparent tannins ply the palate alongside a strong bolt of acidity that tapers off into a pomegranate-imbued finish."}}
{"text_snippet": {"content": "Black-skinned berry, pipe tobacco and Mediterranean herb aromas waft out of the glass and carry over to the firm linear palate along with morello cherry, licorice and a hint of clove. Taut fine-grained tannins and fresh acidity provide the backbone while orange peel marks the finish. Drink 2019–2025."}}
{"text_snippet": {"content": "Wood aging gives this ripe blend of Baga and Touriga Nacional its richness and density. It's full of black fruit, toast and a touch of pepper. With ripe tannins and crisp acidity, it can easily age another year. Drink from 2018."}}
{"text_snippet": {"content": "Pithy, with grapefruit and lemon peel flavors, this wine is deceptively crisp and light on the nose, offering a wealth of body and lushness on the palate, accented with nutmeg and peach. It includes 4% Sémillon, partly from the winery's beloved To Kalon vineyard."}}
{"text_snippet": {"content": "From a vineyard in Northern Tokaj this dry Furmint has aromas of citrus pith and freshly cut pineapple. In the mouth, there are delightful flavors of grapefruit juice and white peach before the pleasantly acidic finish."}}
{"text_snippet": {"content": "Briny green olive notes underlie a tropically ripe, full-bodied expression of the variety. The wine's apple, pineapple and mango fruit is wrapped in toasted oak and moderate acidity."}}
{"text_snippet": {"content": "This opens with enticing aromas of chamomile flower, white peach and a whiff of Alpine herb. The elegant palate offers McIntosh apple, candied lemon and a vein of energizing mineral. Fresh acidity lends balance."}}
{"text_snippet": {"content": "Chopped herb, forest floor, leather, espresso and a balsamic note are some of the aromas that waft out of the glass. The powerfully structured palate delivers prune, dried cherry, tobacco, and roasted coffee bean framed in firm fine-grained tannins. Give the tannins a few more years to unwind then drink to capture the fruit richness. Drink 2018–2023."}}
{"text_snippet": {"content": "Bright and creamy, this savory white offers aromas and flavors of ripe apple, Bartlett pear, Alpine herb and a citrus note. Fresh acidity and a mineral vein energize the finish."}}
{"text_snippet": {"content": "Blackberry and road-tar aromas are dark and stout. This is moderately tannic and a bit rough and jagged on the palate. Flavors of stewed black plum and prune are ripe almost to an extreme, and that's how it finishes as well."}}
{"text_snippet": {"content": "There's a pleasant, toasty seam throughout the nose and mouth of this well-balanced wine, expressed in notes of sweet spice and honeycomb that frame the yellow melon and apple fruit core. It's plush and mouthfilling, but not flabby or overdone, thanks to balancing acidity and an assertive spicy tone that dominates the finish. Drink now."}}
{"text_snippet": {"content": "This is a round and rich wine, with notes of wood-grilled apple, guava and toasted challah. Smooth and lush in feel, ripe peach and tropical tones drive the palate, while hints of honeysuckle and baking spice unfold on the finish. Ample acidity keeps the wine's weight in check. Drink now."}}
{"text_snippet": {"content": "The deep ruby color belies this wines cool-climate origins. The nose shows more black fruit aromas than is typical for Pinot Noir. The palate is all Pinot, though, with cherry pie filling flavors made more complex by vanilla from toasty new oak. It finishes with some nice mineral and earth notes. Silky tannins allow for immediate consumption but the wine will gain in complexity after a year or two in the cellar."}}
{"text_snippet": {"content": "A thoroughly honest effort, opening with lovely quince, apple and lemon fruit. The palate has a crisp lime edge and finishes with a kick of refreshing acidity. Drink now."}}
{"text_snippet": {"content": "Not clear what the varietal blend is, but it's like a nice, easy southern Rhône wine. Soft and fruity, it's rich in jammy blackberry, cherry, Mandarin orange, chocolate and anise spice flavors."}}
{"text_snippet": {"content": "Orange blossom and flowers lead on this Gewürtz, and on the palate, a citric, lemon edge outweighs the sweet and floral components that would give this wine a prettier edge. Nonetheless, the wine has an attractive, crisp and clean character and will pair well with grilled seafood and poultry."}}
{"text_snippet": {"content": "Meaty and rubbery, but that's young Bonarda. This is a sound wine with dark berry flavors, raisin and pulsing acidity. Still, there's modest roundness to the palate and length to the finish. Overall, it's tasty, full and borderline raisiny. Drink now."}}
{"text_snippet": {"content": "Lifted cedar and pine notes interspersed with appealing woodsy scents give way to a surprisingly intense palate that shows some nice peppery notes but ultimately falls short on the finish. Nearly imperceptible tannins suggest early consumption."}}
{"text_snippet": {"content": "There is an odd, piercing edge to the aromas, a mix of acetic acid and pungent herb, with a hint of diesel. Somehow it's not off-putting, just atypical. The light, tart fruit is a mix of rhubarb and cranberry, very earthy and tasting of dirt and bark in the finish. This could be quite pleasant with a hearty, rustic dish such as beef Bourgogne."}}
{"text_snippet": {"content": "Neutral and unassuming on first impact, this luminous rosé eventually delivers notes of mineral, ash, stone fruit and small berry. The wine offers more in the mouth, however, where it exhibits fresh flavors of raspberry and blueberry."}}
{"text_snippet": {"content": "Overly sweet and simple, and something of a disappointment given the winery's past performance, this Syrah tastes like melted cherry jam, stirred with chocolate pie filling and sprinkled with fennel and pepper."}}
{"text_snippet": {"content": "Shows rich, firm mountain tannins and well-ripened, concentrated flavors of blackberries, cherries, currants and cocoa, and is thoroughly dry. But the wine loses a few points for hot caramelization, which may be partly over-charred oak and partly shriveled, overripe berries, if not both."}}
{"text_snippet": {"content": "The wine boasts a beautiful appearance thanks to its saturated golden color and faint amber highlights. It has a very fragrant nose and offers honey, peach and soapy floral notes. In the mouth, the wine delivers sweet fruit and a soft, silky texture."}}
{"text_snippet": {"content": "The sort of wine one imagines early Australian settlers gulped down—big and burly in the mouth and a bit warm, rough and dusty on the finish. Hints of mint-accented cherry fruit and earthy notes."}}
{"text_snippet": {"content": "A little rough and rugged, with jangly tannins and blackberry fruit so ripe it veers into raisins. Very dry, it's probably at its best now."}}
{"text_snippet": {"content": "Dominated by Ugni Blanc, the grape also used in the local Armagnac brandy, this is a tight, crisp wine, green but not unpleasantly so. Its acidity comes from fresh apple flavors, touched with some good juiciness and a fine refreshing finish. Screwcap."}}
{"text_snippet": {"content": "Sweetly rich in cherry, red currant and chocolate flavors, with a peppery edge, this Sangiovese is soft in structure. The bright acidity can cut through tomato sauce with cheese."}}
{"text_snippet": {"content": "Made in the modern California style, with very ripe, rather sweet pineapple jam, green apple butter and smoky oak flavors that are wrapped into a creamy texture."}}
{"text_snippet": {"content": "This sparkling wine starts with a toasty but soft nose, leading into clean but fruity flavors and a refreshing finish. Though an earlier release might have allowed more primary fruit to show through, the wine offers easygoing but elegant enjoyment."}}
{"text_snippet": {"content": "Simple but well-maded wine with aromas of chewing gum, cherry and blackberry. It's a plump, sort of grabby red with sweet raspberry and chocolate flavors followed by a creamy, soft finish. Not much complexity but good fruit and depth. Not the least bit hard to drink. Good mass wine."}}
{"text_snippet": {"content": "Not exactly a world-class white wine but at least it smells and tastes like Chardonnay. The nose offers some butter and lemon curd, while the palate is jumpy and tastes like a mix of pear, apple and spice. A fresh, young wine that should be drunk soon."}}
{"text_snippet": {"content": "Juicy and well balanced, this is an admirable effort at the price. Boxwood, grapefruit, lemon and quince notes make for a sophisticated first impression. The palate is straightforward citrus while gooseberry notes pop up on the dry finish. Drink now."}}
{"text_snippet": {"content": "Tasty, with pie-filling cherries, blackberries and currants accented with smoky oak, but a little on the soft side. Fully developed, so drink now."}}
{"text_snippet": {"content": "This seems as if it was assembled from lesser barrels. It's pleasant, very light, simple and tart; the dominant flavor is cranberry juice."}}
